modm-ext/data.modm.io/docs/svd/header_stm32h553xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIM2">
      <name>TIM2_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50000000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM3">
      <name>TIM3_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50000400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM3">
      <name>TIM4_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50000800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM2">
      <name>TIM5_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50000c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM6">
      <name>TIM6_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50001000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM6">
      <name>TIM7_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50001400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM12">
      <name>TIM12_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50001800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="WWDG">
      <name>WWDG_S</name>
      <description>WWDG</description>
      <groupName>WWDG</groupName>
      <baseAddress>0x50002c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="IWDG">
      <name>IWDG_S</name>
      <description>IWDG</description>
      <groupName>IWDG</groupName>
      <baseAddress>0x50003000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI2_S</name>
      <description>SPI</description>
      <groupName>SPI</groupName>
      <baseAddress>0x50003800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI3_S</name>
      <description>SPI</description>
      <groupName>SPI</groupName>
      <baseAddress>0x50003c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="COMP12">
      <name>COMP12_S</name>
      <description>Comparator</description>
      <groupName>COMPOPT</groupName>
      <baseAddress>0x50004000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="COMP1">
      <name>COMP1_S</name>
      <groupName>COMP</groupName>
      <baseAddress>0x5000400c</baseAddress>
    </peripheral>
    <peripheral derivedFrom="COMP1">
      <name>COMP2_S</name>
      <groupName>COMP</groupName>
      <baseAddress>0x50004010</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART2">
      <name>USART2_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50004400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART2">
      <name>USART3_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50004800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART4_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50004c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART5_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50005000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C1_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <groupName>I2C</groupName>
      <baseAddress>0x50005400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C2_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <groupName>I2C</groupName>
      <baseAddress>0x50005800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I3C1">
      <name>I3C1_S</name>
      <description>Improved Inter-integrated Circuit Interface</description>
      <groupName>I3C</groupName>
      <baseAddress>0x50005c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="CRS">
      <name>CRS_S</name>
      <description>Clock Recovery System</description>
      <groupName>CRS</groupName>
      <baseAddress>0x50006000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART2">
      <name>USART6_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50006400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="CEC">
      <name>CEC_S</name>
      <description>Consumer Electronics Control</description>
      <groupName>CEC</groupName>
      <baseAddress>0x50007000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART7_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50007800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART8_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50007c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DTS">
      <name>DTS_S</name>
      <description>DTS</description>
      <groupName>DTS</groupName>
      <baseAddress>0x50008c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM2_S</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x50009400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FDCAN1">
      <name>FDCAN1_S</name>
      <description>FD Controller Area Network</description>
      <groupName>FDCAN_Global</groupName>
      <baseAddress>0x5000a400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FDCAN_CONFIG">
      <name>FDCAN_CONFIG_S</name>
      <description>FD Controller Area Network Configuration</description>
      <groupName>FDCAN_Config</groupName>
      <baseAddress>0x5000a500</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FDCAN1">
      <name>FDCAN2_S</name>
      <description>FD Controller Area Network</description>
      <groupName>FDCAN_Global</groupName>
      <baseAddress>0x5000a800</baseAddress>
    </peripheral>
